great optimism: e2e tests ostensibly passing, functional/ library complete and about to be exported
